app/controllers/songs_controller.rb

INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "This is a test song!"], ["artist_id", 1], ["created_at", "2016-02-01 09:00:33.478413"], ["updated_at", "2016-02-01 09:00:33.478413"]]
---
  def create
    @song = Song.new(song_params)
    @song.save